#include <iostream>;
using namespace std;
int main() {
	cout << "企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10 % 提成，高于10万元的部分，可可提成7.5 % ；20万到40万之间时，高于20万元的部分，可提成5 % ；40万到60万之间时高于40万元的部分，可提成3 % ；60万到100万之间时，高于60万元的部分，可提成1.5 % ，高于100万元时，超过100万元的部分按1 % 提成，从键盘输入当月利润I，求应发放奖金总数？" << endl;
	double i = 0;
	cout << "奖金(单位万)：";
	cin >> i;
	if (i < 0)
		cout << '\n' << "奖金应大于等于0。" << endl;

	switch (int(i / 10)) {
	case 0:cout << i * 0.1; break;
	case 1:cout << 10 * 0.1 + (i - 10) * 0.075; break;
	case 2:
	case 3:cout << 10 * 0.1 + 10 + 0.075 + (i - 20) * 0.05; break;
	case 4:
	case 5:cout << 10 * 0.1 + 10 + 0.075 + 20 * 0.05 + (i - 40) * 0.03; break;
	case 6:
	case 7:
	case 8:
	case 9:cout << 10 * 0.1 + 10 + 0.075 + 20 * 0.05 + 20 * 0.03 + (i - 60) * 0.015; break;
	default:cout << 10 * 0.1 + 10 + 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (i - 100) * 0.01; break;
	
	}
	return 0;
}