/*
吴志建	33	918103860635
9.27	第 2 次作业
48页23、24、25、26、27、28（1）
*/

/*
23题：
x > 2 && x % 2 ==0
*/

/*
24题：
x > 8 || x < -8
*/

/*
25题：
(A):	1/3 = 0
(B):	1/3.0 = 0.333333
(C):	1%3 = 1
(D):	21/3 = 7
*/

/*
26题：
(A):	4
(B):	27
(C):	8
(D):	162
*/

/*
27题：
(A):	1
(B):	1
(C):	31
(D):	0
*/

//28题：
#include<iostream>
using namespace std;
int main()
{
	double c;
	cout << "输入摄氏温度C：";
	while (cin >> c)
	{
		cout << "华氏温度F：" << c * 9.0 / 5 + 32 << endl;
		cout << "绝对温度K：" << c + 273.15 << endl << endl;
		cout << "输入摄氏温度C：";
	}
	return 0;
}